[GraphicalObject]
Name=als
Path=diagtop
; RC-DLL=diaggui.dll
PosStyle=VARIABLE
WndStyle=
x= 0
y= 0
width=510
height= 220
Set0="BMP.dgAutoIn|dgChangeDiagHelpIndex INSTPANEL| "

[ToolDescriptor]
1=gototop   ,  PUSHBUTTON ,hpgbut02.dll
2=logbook   ,  IMAGESET   ,hpgbut02.dll
3=temp      ,  IMAGESET   ,hpgbut02.dll
4=method    ,  IMAGESET   ,hpgbut02.dll
5=needle    ,  IMAGESET   ,hpgbut02.dll
6=valve     ,  IMAGESET   ,hpgbut02.dll
7=tray      ,  IMAGESET   ,hpgbut02.dll


[PUSHBUTTON gototop]
x=4
y=4
width=50
height=43
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList=BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top
Command=dgGotoTopLevel als
Help=機器パネルのトップレベルへの切替


[IMAGESET logbook]
x=455
y=9
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|@view.floatingmenu "DiagGuiReg[4]", "ALSlogbook"|サンプラ/インジェクタ ログブック
set1= BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|@view.floatingmenu "DiagGuiReg[4]", "ALSlogbook"|サンプラ/インジェクタ ログブック
Cursor= CUR...\..\LC\800\HAND1
Help=""


[IMAGESET temp]
x=455
y=109
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|@view.floatingmenu "DiagGuiReg[4]", "ALStemp"|サンプラ/インジェクタ温度
set1= BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|@view.floatingmenu "DiagGuiReg[4]", "ALStemp"|サンプラ/インジェクタ温度
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET method]
x=455
y=59
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|@view.floatingmenu "DiagGuiReg[4]", "ALSmethod"|サンプラ/インジェクタ メソッド
set1= BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|@view.floatingmenu "DiagGuiReg[4]", "ALSmethod"|サンプラ/インジェクタ メソッド
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET needle]
x=237
y=70
width=71
height=75
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgneedl1|BMP.dgneedl1|BMP.dgneedl1|@view.floatingmenu "DiagGuiReg[4]", "ALSneedle"|サンプラ/インジェクタ ニードル ユニット
set1= BMP.dgneedl2|BMP.dgneedl2|BMP.dgneedl2|@view.floatingmenu "DiagGuiReg[4]", "ALSneedle"|サンプラ/インジェクタ ニードル ユニット
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET valve]
x=318
y=112
width=56
height=49
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dginjv1|BMP.dginjv1|BMP.dginjv1|@view.floatingmenu "DiagGuiReg[4]", "ALSvalve"|サンプラ/インジェクタ インジェクション バルブ
set1= BMP.dginjv2|BMP.dginjv2|BMP.dginjv2|@view.floatingmenu "DiagGuiReg[4]", "ALSvalve"|サンプラ/インジェクタ インジェクション バルブ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET tray]
x=170
y=160
width=74
height=48
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgtray1|BMP.dgtray1|BMP.dgtray1|@view.floatingmenu "DiagGuiReg[4]", "ALSTray"|サンプラ/インジェクタ冷却サンプル トレイ
set1= BMP.dgtray2|BMP.dgtray2|BMP.dgtray2|@view.floatingmenu "DiagGuiReg[4]", "ALSTray"|サンプラ/インジェクタ冷却サンプル トレイ
set2= BMP.dgnotray|BMP.dgnotray|BMP.dgnotray||
Help=""
